1c/DataProcessors/json_export.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>json_export</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1c/Catalogs/leads.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>leads</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>lead_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.source</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>current_stage</Name>
					<Type>
						<v8:Type>cfg:EnumRef.current_stage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>owner_fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/DataProcessors/json_export/Ext/ObjectModule.bsl
Процедура ЭкспортJson() Экспорт   
	ПутьКФайлу = "D:/crm_14/CRM_14/json/leads.json";
	                                          	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу,,,);
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Выборка = Справочники.leads.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("lead_id");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.lead_id);
		ЗаписьJSON.ЗаписатьИмяСвойства("current_stage");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Выборка.current_stage));
		ЗаписьJSON.ЗаписатьИмяСвойства("source");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Выборка.source));		
		ЗаписьJSON.ЗаписатьИмяСвойства("owner_fio");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.owner_fio);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры
